package step6_02.method;

/*
 * 
 *  # 메서드의 4가지 형태
 * 
 * 		- 입력값(파라메타 , 매개변수 , 인수 , 인자 , 아규먼트)과 결과값(return)의 유무에 따라 4가지 형태로 구분할 수 있다.
 * 
 * 		입력값이 있고 , 결과값이 있다. ( 11 )
 * 		입력값이 있고 , 결과값이 없다. ( 10 )
 * 		입력값이 없고 , 결과값이 있다. ( 01 )
 * 		입력값이 없고 , 결과값이 없다. ( 00 )
 * 
 * */

class MethodType {
	
	// 입력값도 없고 결과값도 없는 경우
	
	// 입력값은 있고 결과값은 없는 경우
	
	// 입력값은 없고 결과값은 있는 경우
	
	// 입력값과 결과값이 모두 있는 경우
	
}


public class MethodEx02 {

	public static void main(String[] args) {
		
		// 입력값도 없고 결과값도 없는 경우
		
		
		// 입력값은 있고 결과값은 없는 경우
		
		// 입력값은 없고 결과값은 있는 경우
		
		
		// 입력값과 결과값이 모두 있는 경우
		
	}

}


